chtMultiregionFoam/hot_sphere_in_oil/exptCaseLES/constant/oil/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/oil/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    maxY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1980;
        startFace       510084;
    }

    minX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       512064;
    }

    maxX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       512964;
    }

    minY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1980;
        startFace       513864;
    }

    minZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       515844;
    }

    maxZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       516744;
    }

    oil_to_sphere
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          1536;
        startFace       517644;
        sampleMode      nearestPatchFace;
        sampleRegion    sphere;
        samplePatch     sphere_to_oil;
    }

)


// ************************************************************************* //
