chtMultiregionFoam/hot_sphere_in_oil/exptCaseLES/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1980;
        startFace       533844;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       535824;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       536724;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1980;
        startFace       537624;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       539604;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       540504;
    }
)

// ************************************************************************* //
