chtMultiregionFoam/hot_sphere_in_oil/exptCaseLES/constant/sphere/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/sphere/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


1
(
    sphere_to_oil
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          1536;
        startFace       22224;
        sampleMode      nearestPatchFace;
        sampleRegion    oil;
        samplePatch     oil_to_sphere;
    }

)


// ************************************************************************* //
